{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|im_start|>": 1,
      "<|im_end|>": 2,
      "<pad>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "À": 128,
      "Á": 129,
      "Â": 130,
      "Ã": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Ë": 139,
      "Ì": 140,
      "Í": 141,
      "Î": 142,
      "Ï": 143,
      "Ð": 144,
      "Ñ": 145,
      "Ò": 146,
      "Ó": 147,
      "Ô": 148,
      "Õ": 149,
      "Ö": 150,
      "×": 151,
      "Ø": 152,
      "Ù": 153,
      "Ú": 154,
      "Û": 155,
      "Ü": 156,
      "Ý": 157,
      "Þ": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ā": 193,
      "Ă": 194,
      "ă": 195,
      "Ą": 196,
      "ą": 197,
      "Ć": 198,
      "ć": 199,
      "Ĉ": 200,
      "ĉ": 201,
      "Ċ": 202,
      "ċ": 203,
      "Č": 204,
      "č": 205,
      "Ď": 206,
      "ď": 207,
      "Đ": 208,
      "đ": 209,
      "Ē": 210,
      "ē": 211,
      "Ĕ": 212,
      "ĕ": 213,
      "Ė": 214,
      "ė": 215,
      "Ę": 216,
      "ę": 217,
      "Ě": 218,
      "ě": 219,
      "Ĝ": 220,
      "ĝ": 221,
      "Ğ": 222,
      "ğ": 223,
      "Ġ": 224,
      "ġ": 225,
      "Ģ": 226,
      "ģ": 227,
      "Ĥ": 228,
      "ĥ": 229,
      "Ħ": 230,
      "ħ": 231,
      "Ĩ": 232,
      "ĩ": 233,
      "Ī": 234,
      "ī": 235,
      "Ĭ": 236,
      "ĭ": 237,
      "Į": 238,
      "į": 239,
      "İ": 240,
      "ı": 241,
      "Ĳ": 242,
      "ĳ": 243,
      "Ĵ": 244,
      "ĵ": 245,
      "Ķ": 246,
      "ķ": 247,
      "ĸ": 248,
      "Ĺ": 249,
      "ĺ": 250,
      "Ļ": 251,
      "ļ": 252,
      "Ľ": 253,
      "ľ": 254,
      "Ŀ": 255,
      "ŀ": 256,
      "Ł": 257,
      "ł": 258,
      "Ń": 259,
      "er": 260,
      "in": 261,
      "ns": 262,
      "st": 263,
      "Ġa": 264,
      "Ġt": 265,
      "<|": 266,
      "at": 267,
      "en": 268,
      "hin": 269,
      "im": 270,
      "io": 271,
      "is": 272,
      "wer": 273,
      "|>": 274,
      "nswer": 275,
      "hink": 276,
      "ar": 277,
      "or": 278,
      "Ġb": 279,
      "Ġf": 280,
      "Ġis": 281,
      "ion": 282,
      "'s": 283,
      ".<": 284,
      "an": 285,
      "answer": 286,
      "de": 287,
      "he": 288,
      "il": 289,
      "iz": 290,
      "ken": 291,
      "mo": 292,
      "oken": 293,
      "pt": 294,
      "think": 295,
      "uc": 296,
      "Ġc": 297,
      "Ġo": 298,
      "Ġw": 299,
      "ing": 300,
      "star": 301,
      "Ġanswer": 302,
      "ation": 303,
      "end": 304,
      "Ġbe": 305,
      ".</": 306,
      "okeniz": 307,
      "start": 308,
      "!<|": 309,
      "><": 310,
      "?<|": 311,
      "BP": 312,
      "He": 313,
      "LL": 314,
      "Le": 315,
      "Lan": 316,
      "No": 317,
      "Opt": 318,
      "Think": 319,
      "The": 320,
      "Tokeniz": 321,
      "We": 322,
      "Wh": 323,
      "ag": 324,
      "al": 325,
      "as": 326,
      "ain": 327,
      "der": 328,
      "dat": 329,
      "ding": 330,
      "ee": 331,
      "ep": 332,
      "ex": 333,
      "ear": 334,
      "for": 335,
      "gu": 336,
      "his": 337,
      "ir": 338,
      "ist": 339,
      "ial": 340,
      "ider": 341,
      "ld": 342,
      "ll": 343,
      "ls": 344,
      "lear": 345,
      "ms": 346,
      "muc": 347,
      "om": 348,
      "ou": 349,
      "ons": 350,
      "ruc": 351,
      "ration": 352,
      "rain": 353,
      "rom": 354,
      "ser": 355,
      "see": 356,
      "sist": 357,
      "tw": 358,
      "ty": 359,
      "tration": 360,
      "up": 361,
      "uil": 362,
      "user": 363,
      "you": 364,
      "ĠA": 365,
      "Ġst": 366,
      "Ġde": 367,
      "Ġmo": 368,
      "ĠBP": 369,
      "ĠLL": 370,
      "Ġdat": 371,
      "Ġlear": 372,
      "Ġmuc": 373,
      "Ġsee": 374,
      "Ġup": 375,
      "Ġyou": 376,
      "nstration": 377,
      "Ġthink": 378,
      "Ġthe": 379,
      "Ġtokeniz": 380,
      "Ġtex": 381,
      "Ġthis": 382,
      "Ġtrain": 383,
      "ions": 384,
      "orld": 385,
      "orty": 386,
      "Ġbuil": 387,
      "Ġfir": 388,
      "Ġfrom": 389,
      "Ġforty": 390,
      "ant": 391,
      "dels": 392,
      "ill": 393,
      "monstration": 394,
      "ptions": 395,
      "Ġcons": 396,
      "Ġcruc": 397,
      "Ġof": 398,
      "Ġoptions": 399,
      "Ġworld": 400,
      "Ġwill": 401,
      "Ġbest": 402,
      "Ġbefor": 403,
      "Hell": 404,
      "Let": 405,
      "Langu": 406,
      "Not": 407,
      "Option": 408,
      "Tokenization": 409,
      "What": 410,
      "age": 411,
      "assist": 412,
      "two": 413,
      "Ġstep": 414,
      "Ġdemonstration": 415,
      "Ġmodels": 416,
      "ĠBPE": 417,
      "ĠLLM": 418,
      "Ġdata": 419,
      "Ġlearn": 420,
      "Ġmuch": 421,
      "Ġseems": 422,
      "Ġthinking": 423,
      "Ġtokenizer": 424,
      "Ġtext": 425,
      "Ġbuilding": 426,
      "Ġfirst": 427,
      "Ġconsider": 428,
      "Ġcrucial": 429,
      "Ġbefore": 430,
      "Hello": 431,
      "Language": 432,
      "assistant": 433
    },
    "merges": [
      [
        "e",
        "r"
      ],
      [
        "i",
        "n"
      ],
      [
        "n",
        "s"
      ],
      [
        "s",
        "t"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "<",
        "|"
      ],
      [
        "a",
        "t"
      ],
      [
        "e",
        "n"
      ],
      [
        "h",
        "in"
      ],
      [
        "i",
        "m"
      ],
      [
        "i",
        "o"
      ],
      [
        "i",
        "s"
      ],
      [
        "w",
        "er"
      ],
      [
        "|",
        ">"
      ],
      [
        "ns",
        "wer"
      ],
      [
        "hin",
        "k"
      ],
      [
        "a",
        "r"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "io",
        "n"
      ],
      [
        "'",
        "s"
      ],
      [
        ".",
        "<"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "nswer"
      ],
      [
        "d",
        "e"
      ],
      [
        "h",
        "e"
      ],
      [
        "i",
        "l"
      ],
      [
        "i",
        "z"
      ],
      [
        "k",
        "en"
      ],
      [
        "m",
        "o"
      ],
      [
        "o",
        "ken"
      ],
      [
        "p",
        "t"
      ],
      [
        "t",
        "hink"
      ],
      [
        "u",
        "c"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "in",
        "g"
      ],
      [
        "st",
        "ar"
      ],
      [
        "Ġa",
        "nswer"
      ],
      [
        "at",
        "ion"
      ],
      [
        "en",
        "d"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        ".<",
        "/"
      ],
      [
        "oken",
        "iz"
      ],
      [
        "star",
        "t"
      ],
      [
        "!",
        "<|"
      ],
      [
        ">",
        "<"
      ],
      [
        "?",
        "<|"
      ],
      [
        "B",
        "P"
      ],
      [
        "H",
        "e"
      ],
      [
        "L",
        "L"
      ],
      [
        "L",
        "e"
      ],
      [
        "L",
        "an"
      ],
      [
        "N",
        "o"
      ],
      [
        "O",
        "pt"
      ],
      [
        "T",
        "hink"
      ],
      [
        "T",
        "he"
      ],
      [
        "T",
        "okeniz"
      ],
      [
        "W",
        "e"
      ],
      [
        "W",
        "h"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "s"
      ],
      [
        "a",
        "in"
      ],
      [
        "d",
        "er"
      ],
      [
        "d",
        "at"
      ],
      [
        "d",
        "ing"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "p"
      ],
      [
        "e",
        "x"
      ],
      [
        "e",
        "ar"
      ],
      [
        "f",
        "or"
      ],
      [
        "g",
        "u"
      ],
      [
        "h",
        "is"
      ],
      [
        "i",
        "r"
      ],
      [
        "i",
        "st"
      ],
      [
        "i",
        "al"
      ],
      [
        "i",
        "der"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "l"
      ],
      [
        "l",
        "s"
      ],
      [
        "l",
        "ear"
      ],
      [
        "m",
        "s"
      ],
      [
        "m",
        "uc"
      ],
      [
        "o",
        "m"
      ],
      [
        "o",
        "u"
      ],
      [
        "o",
        "ns"
      ],
      [
        "r",
        "uc"
      ],
      [
        "r",
        "ation"
      ],
      [
        "r",
        "ain"
      ],
      [
        "r",
        "om"
      ],
      [
        "s",
        "er"
      ],
      [
        "s",
        "ee"
      ],
      [
        "s",
        "ist"
      ],
      [
        "t",
        "w"
      ],
      [
        "t",
        "y"
      ],
      [
        "t",
        "ration"
      ],
      [
        "u",
        "p"
      ],
      [
        "u",
        "il"
      ],
      [
        "u",
        "ser"
      ],
      [
        "y",
        "ou"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "Ġ",
        "st"
      ],
      [
        "Ġ",
        "de"
      ],
      [
        "Ġ",
        "mo"
      ],
      [
        "Ġ",
        "BP"
      ],
      [
        "Ġ",
        "LL"
      ],
      [
        "Ġ",
        "dat"
      ],
      [
        "Ġ",
        "lear"
      ],
      [
        "Ġ",
        "muc"
      ],
      [
        "Ġ",
        "see"
      ],
      [
        "Ġ",
        "up"
      ],
      [
        "Ġ",
        "you"
      ],
      [
        "ns",
        "tration"
      ],
      [
        "Ġt",
        "hink"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġt",
        "okeniz"
      ],
      [
        "Ġt",
        "ex"
      ],
      [
        "Ġt",
        "his"
      ],
      [
        "Ġt",
        "rain"
      ],
      [
        "io",
        "ns"
      ],
      [
        "or",
        "ld"
      ],
      [
        "or",
        "ty"
      ],
      [
        "Ġb",
        "uil"
      ],
      [
        "Ġf",
        "ir"
      ],
      [
        "Ġf",
        "rom"
      ],
      [
        "Ġf",
        "orty"
      ],
      [
        "an",
        "t"
      ],
      [
        "de",
        "ls"
      ],
      [
        "il",
        "l"
      ],
      [
        "mo",
        "nstration"
      ],
      [
        "pt",
        "ions"
      ],
      [
        "Ġc",
        "ons"
      ],
      [
        "Ġc",
        "ruc"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "Ġo",
        "ptions"
      ],
      [
        "Ġw",
        "orld"
      ],
      [
        "Ġw",
        "ill"
      ],
      [
        "Ġbe",
        "st"
      ],
      [
        "Ġbe",
        "for"
      ],
      [
        "He",
        "ll"
      ],
      [
        "Le",
        "t"
      ],
      [
        "Lan",
        "gu"
      ],
      [
        "No",
        "t"
      ],
      [
        "Opt",
        "ion"
      ],
      [
        "Tokeniz",
        "ation"
      ],
      [
        "Wh",
        "at"
      ],
      [
        "ag",
        "e"
      ],
      [
        "as",
        "sist"
      ],
      [
        "tw",
        "o"
      ],
      [
        "Ġst",
        "ep"
      ],
      [
        "Ġde",
        "monstration"
      ],
      [
        "Ġmo",
        "dels"
      ],
      [
        "ĠBP",
        "E"
      ],
      [
        "ĠLL",
        "M"
      ],
      [
        "Ġdat",
        "a"
      ],
      [
        "Ġlear",
        "n"
      ],
      [
        "Ġmuc",
        "h"
      ],
      [
        "Ġsee",
        "ms"
      ],
      [
        "Ġthink",
        "ing"
      ],
      [
        "Ġtokeniz",
        "er"
      ],
      [
        "Ġtex",
        "t"
      ],
      [
        "Ġbuil",
        "ding"
      ],
      [
        "Ġfir",
        "st"
      ],
      [
        "Ġcons",
        "ider"
      ],
      [
        "Ġcruc",
        "ial"
      ],
      [
        "Ġbefor",
        "e"
      ],
      [
        "Hell",
        "o"
      ],
      [
        "Langu",
        "age"
      ],
      [
        "assist",
        "ant"
      ]
    ]
  }
}